Repository: yuki-kimoto/mojolicious-guides-japanese
Catalog: Mojo-OmegaT-omegat.tmx
Source language: en
Languages: ja

source: For Ajax requests and the like, you can also generate a token directly with the helper L<Mojolicious::Plugin::DefaultHelpers/"csrf_token">, and then pass it along with the C<X-CSRF-Token> request header.
ja: For Ajax requests and the like, you can also generate a token directly with the helper [[Mojolicious::Plugin::DefaultHelpers/"csrf_token"]], and then pass it along with the C<X-CSRF-Token> request header.

source: For Comet (long polling) you might also want to increase the inactivity timeout with L<Mojolicious::Plugin::DefaultHelpers/"inactivity_timeout">, which usually defaults to C<15> seconds.
ja: For Comet (long polling) you might also want to increase the inactivity timeout with [[Mojolicious::Plugin::DefaultHelpers/"inactivity_timeout"]], which usually defaults to C<15> seconds.

source: For a full list of commands that are available by default see L<Mojolicious::Commands/"COMMANDS">.
ja: For a full list of commands that are available by default see [[Mojolicious::Commands/"COMMANDS"]].

source: For a full list of available CSS selectors see L<Mojo::DOM::CSS/"SELECTORS">.
ja: For a full list of available CSS selectors see [[Mojo::DOM::CSS/"SELECTORS"]].

source: For a full list of available checks see also L<Mojolicious::Validator/"CHECKS">.
ja: For a full list of available checks see also [[Mojolicious::Validator/"CHECKS"]].

source: For a full list of available hooks see L<Mojolicious/"HOOKS">.
ja: For a full list of available hooks see [[Mojolicious/"HOOKS"]].

source: For a full list of available placeholder types see also L<Mojolicious::Routes/"TYPES">.
ja: For a full list of available placeholder types see also [[Mojolicious::Routes/"TYPES"]].

source: For a full list of reserved stash values see L<Mojolicious::Controller/"stash">.
ja: For a full list of reserved stash values see [[Mojolicious::Controller/"stash"]].

source: For a full list of shared options see L<Mojolicious::Commands/"SYNOPSIS">.
ja: For a full list of shared options see [[Mojolicious::Commands/"SYNOPSIS"]].

source: For a little more power you can introspect the preceding and succeeding destinations with L<Mojolicious::Controller/"match">.
ja: For a little more power you can introspect the preceding and succeeding destinations with [[Mojolicious::Controller/"match"]].

source: For all templates L<strict>, L<warnings>, L and Perl 5.10 L<features|feature> are automatically enabled.
ja: For all templates [[strict]], [[warnings]], [[utf8]] and Perl 5.10 [[features|feature]] are automatically enabled.

source: For better performance the optional module L<Cpanel::JSON::XS> (4.04+) will be used automatically if possible.
ja: For better performance the optional module [[Cpanel::JSON::XS]] (4.04+) will be used automatically if possible.

source: For better scalability (epoll, kqueue) and to provide non-blocking name resolution, SOCKS5 as well as TLS support, the optional modules L<EV> (4.0+), L<Net::DNS::Native> (0.15+), L<IO::Socket::Socks> (0.64+) and L<IO::Socket::SSL> (1.84+) will be used automatically if possible.
ja: For better scalability (epoll, kqueue) and to provide non-blocking name resolution, SOCKS5 as well as TLS support, the optional modules [[EV]] (4.0+), [[Net::DNS::Native]] (0.15+), [[IO::Socket::Socks]] (0.64+) and [[IO::Socket::SSL]] (1.84+) will be used automatically if possible.

source: For better scalability (epoll, kqueue) and to provide non-blocking name resolution, SOCKS5 as well as TLS support, the optional modules L<EV> (4.0+), L<Net::DNS::Native> (0.15+), L<IO::Socket::Socks> (0.64+) and L<IO::Socket::SSL> (2.009+) will be used automatically if possible.
ja: For better scalability (epoll, kqueue) and to provide non-blocking name resolution, SOCKS5 as well as TLS support, the optional modules [[EV]] (4.0+), [[Net::DNS::Native]] (0.15+), [[IO::Socket::Socks]] (0.64+) and [[IO::Socket::SSL]] (2.009+) will be used automatically if possible.

source: For bigger applications L<Mojolicious> contains the UNIX optimized pre-forking web server L<Hypnotoad|Mojo::Server::Hypnotoad>, which can take advantage of multiple CPU cores and copy-on-write memory management to scale up to thousands of concurrent client connections.
ja: For bigger applications [[Mojolicious]] contains the UNIX optimized pre-forking web server [[Hypnotoad|Mojo::Server::Hypnotoad]], which can take advantage of multiple CPU cores and copy-on-write memory management to scale up to thousands of concurrent client connections.

source: For data that should only be visible on the next request, like a confirmation message after a C<302> redirect performed with L<Mojolicious::Plugin::DefaultHelpers/"redirect_to">, you can use the flash, accessible through L<Mojolicious::Plugin::DefaultHelpers/"flash">.
ja: For data that should only be visible on the next request, like a confirmation message after a C<302> redirect performed with [[Mojolicious::Plugin::DefaultHelpers/"redirect_to"]], you can use the flash, accessible through [[Mojolicious::Plugin::DefaultHelpers/"flash"]].

source: For developers of other web frameworks, it should be possible to reuse all the infrastructure and just consider the higher levels of the L<Mojolicious> distribution an example application.
ja: For developers of other web frameworks, it should be possible to reuse all the infrastructure and just consider the higher levels of the [[Mojolicious]] distribution an example application.

source: For even more advanced negotiation logic you can also use the helper L<Mojolicious::Plugin::DefaultHelpers/"accepts">.
ja: For even more advanced negotiation logic you can also use the helper [[Mojolicious::Plugin::DefaultHelpers/"accepts"]].

source: For even more control you can also just skip the helper and use L<Mojolicious::Controller/"rendered"> to tell the renderer when you're done generating a response.
ja: For even more control you can also just skip the helper and use [[Mojolicious::Controller/"rendered"]] to tell the renderer when you're done generating a response.

source: For fields that failed validation with L<Mojolicious::Plugin::DefaultHelpers/"validation"> the C<field-with-error> class will be automatically added through L</"tag_with_error">, to make styling with CSS easier.
ja: For fields that failed validation with [[Mojolicious::Plugin::DefaultHelpers/"validation"]] the C<field-with-error> class will be automatically added through [[/"tag_with_error"]], to make styling with CSS easier.

source: For finer control, L</Rewriting> includes examples of how the changes could be implemented manually.
ja: For finer control, [[/Rewriting]] includes examples of how the changes could be implemented manually.

source: For instance, C<$bytes> or C<$chars> to distinguish whether it is encoded bytes or decoded characters in a Perl L<string|perlunifaq>, C<$bool> if the value just indicates true or false, C<$c> to denote a L<Mojolicious::Controller> object, or C<$app> to denote the L<application|Mojolicious> object.
ja: For instance, C<$bytes> or C<$chars> to distinguish whether it is encoded bytes or decoded characters in a Perl [[string|perlunifaq]], C<$bool> if the value just indicates true or false, C<$c> to denote a [[Mojolicious::Controller> object, or C<$app> to denote the [[application|Mojolicious> object.

source: For more information about how to generate content see L<Mojolicious::Guides::Rendering>.
ja: For more information about how to generate content see [[Mojolicious::Guides::Rendering]].

source: For more advanced negotiation logic you can also use L</"accepts">.
ja: For more advanced negotiation logic you can also use [[/"accepts"]].

source: For more books and documentation, check out L<learn.perl.org|http://learn.perl.org/>.
ja: For more books and documentation, check out [[learn.perl.org|http://learn.perl.org/]].

source: For more information about available content generators see also L<Mojo::UserAgent::Transactor/"tx">.
ja: For more information about available content generators see also [[Mojo::UserAgent::Transactor/"tx"]].

source: For more information about how to deploy your application see also L<Mojolicious::Guides::Cookbook/"DEPLOYMENT">.
ja: アプリケーションのデプロイ方法について詳しい情報は、 [[Mojolicious::Guides::Cookbook]]のC<デプロイメント>の項目を見てください。

source: For more information about real-time web features see also L<Mojolicious::Guides::Cookbook/"REAL-TIME WEB">.
ja: リアルタイムウェブ機能についてのより詳しい情報は、[[Mojolicious::Guides::Cookbook]]のC<REAL-TIME WEB>にあります。

source: For more information about templates see also L<Mojolicious::Guides::Rendering/"Embedded Perl">.
ja: テンプレートについて詳しい情報は [[Mojolicious::Guides::Rendering]]のC<埋め込みPerl>の項を見てください。

source: For more information about the format see L<https://www.openssl.org/docs/manmaster/apps/ciphers.html#CIPHER-STRINGS>.
ja: For more information about the format see [[https://www.openssl.org/docs/manmaster/apps/ciphers.html#CIPHER-STRINGS]].

source: For more information about the user agent see also L<Mojolicious::Guides::Cookbook/"USER AGENT">.
ja: ユーザーエージェントについてより詳しい情報は、[[Mojolicious::Guides::Cookbook]]のC<ユーザーエージェント>の項目にあります。

source: For more information see L<Mojolicious::Guides::Rendering/"Embedded Perl">.
ja: For more information see [[Mojolicious::Guides::Rendering/"Embedded Perl"]].

source: For mostly idle WebSockets you might also want to increase the inactivity timeout with L<Mojolicious::Plugin::DefaultHelpers/"inactivity_timeout">, which usually defaults to C<15> seconds.
ja: For mostly idle WebSockets you might also want to increase the inactivity timeout with [[Mojolicious::Plugin::DefaultHelpers/"inactivity_timeout"]], which usually defaults to C<15> seconds.

source: For quick hacks and especially testing, L<ojo> one-liners are also a great choice.
ja: For quick hacks and especially testing, [[ojo]] one-liners are also a great choice.

source: For resources with different representations and that require truly RESTful content negotiation you can also use L<Mojolicious::Plugin::DefaultHelpers/"respond_to"> instead of L<Mojolicious::Controller/"render">.
ja: For resources with different representations and that require truly RESTful content negotiation you can also use [[Mojolicious::Plugin::DefaultHelpers/"respond_to"]] instead of [[Mojolicious::Controller/"render"]].

source: For resources with different representations and that require truly RESTful content negotiation you can also use L<Mojolicious::Plugin::DefaultHelpers/"respond_to">.
ja: 異なる方法で表現されるリソースや本当にRESTfulなコンテントネゴーシエーションが必要な場合は、[[Mojolicious::Plugin::DefaultHelpers]]のC<respond_to>を使用することもできます。

source: For security reasons the dispatcher will always check if the C<controller> is actually a subclass of L<Mojolicious::Controller> or L<Mojo> before dispatching to it.
ja: For security reasons the dispatcher will always check if the C<controller> is actually a subclass of [[Mojolicious::Controller]] or [[Mojo]] before dispatching to it.

source: For serving static files from your C<public> directories, defaults to a L<Mojolicious::Static> object.
ja: For serving static files from your C<public> directories, defaults to a [[Mojolicious::Static]] object.

source: For somewhat static content, like cached JSON data or temporary files, you can create your own and use the helper L<Mojolicious::Plugin::DefaultHelpers/"reply-E<gt>asset"> to serve them while allowing content negotiation to be performed with C<Range>, C<If-Modified-Since> and C<If-None-Match> headers.
ja: For somewhat static content, like cached JSON data or temporary files, you can create your own and use the helper [[Mojolicious::Plugin::DefaultHelpers/"reply-E<gt]]asset"]] to serve them while allowing content negotiation to be performed with C<Range>, C<If-Modified-Since> and C<If-None-Match> headers.

source: For templates that might get rendered in different ways and where you're not sure if a stash value will actually be set, you can just use the helper L<Mojolicious::Plugin::DefaultHelpers/"stash">.
ja: For templates that might get rendered in different ways and where you're not sure if a stash value will actually be set, you can just use the helper [[Mojolicious::Plugin::DefaultHelpers/"stash"]].

source: For very dynamic content you might not know the response content length in advance, that's where the chunked transfer encoding and L<Mojolicious::Controller/"write_chunk"> come in handy.
ja: For very dynamic content you might not know the response content length in advance, that's where the chunked transfer encoding and [[Mojolicious::Controller/"write_chunk"]] come in handy.

source: Force L<File::Find> to always stat directories.
ja: Force [[File::Find]] to always stat directories.

source: Form elements generated with tag helpers from L<Mojolicious::Plugin::TagHelpers> will automatically remember their previous values and add the class C<field-with-error> for fields that failed validation to make styling with CSS easier.
ja: Form elements generated with tag helpers from [[Mojolicious::Plugin::TagHelpers]] will automatically remember their previous values and add the class C<field-with-error> for fields that failed validation to make styling with CSS easier.

source: Formats can be automatically detected from file extensions like C<.html>, they are used to find the right template and generate the correct C<Content-Type> header.
ja: フォーマット（formats）は、C<.html>などのファイル拡張子によって自動的に検出されます。フォーマットは正しいテンプレートを探したり、正確なC<Content-Type>ヘッダーを生成するために使用されます。

source: From application startup until the first request has arrived, all routes can still be moved around or even removed with methods like L<Mojolicious::Routes::Route/"add_child"> and L<Mojolicious::Routes::Route/"remove">.
ja: From application startup until the first request has arrived, all routes can still be moved around or even removed with methods like [[Mojolicious::Routes::Route/"add_child"]] and [[Mojolicious::Routes::Route/"remove"]].

source: From time to time you might want to reuse parts of L<Mojolicious> applications like configuration files, database connection or helpers for other scripts, with this little L<Mojo::Server> based mock server you can just embed them.
ja: From time to time you might want to reuse parts of [[Mojolicious]] applications like configuration files, database connection or helpers for other scripts, with this little [[Mojo::Server]] based mock server you can just embed them.

source: Full L<Mojolicious> applications are a little easier to test, so C<t/login.t> can be simplified.
ja: Full [[Mojolicious]] applications are a little easier to test, so C<t/login.t> can be simplified.

source: Full L<Mojolicious> applications on the other hand are much closer to a well organized CPAN distribution to maximize maintainability.
ja: Full [[Mojolicious]] applications on the other hand are much closer to a well organized CPAN distribution to maximize maintainability.

source: Full featured, UNIX optimized, preforking non-blocking I/O HTTP and WebSocket server with support for zero downtime software upgrades (hot deployment) through L<Mojo::Server::Hypnotoad>.
ja: Full featured, UNIX optimized, preforking non-blocking I/O HTTP and WebSocket server with support for zero downtime software upgrades (hot deployment) through [[Mojo::Server::Hypnotoad]].

source: Full featured, highly portable non-blocking I/O HTTP and WebSocket server, with self-restart support through L<Mojo::Server::Morbo>, perfect for development and testing.
ja: Full featured, highly portable non-blocking I/O HTTP and WebSocket server, with self-restart support through [[Mojo::Server::Morbo]], perfect for development and testing.

source: Fun L<Mojolicious> application hacks for all occasions.
ja: Fun [[Mojolicious]] application hacks for all occasions.

source: Generate C<input> tag of type C<hidden> with L<Mojolicious::Plugin::DefaultHelpers/"csrf_token">.
ja: Generate C<input> tag of type C<hidden> with [[Mojolicious::Plugin::DefaultHelpers/"csrf_token"]].

source: Generate C<select> and C<option> tags from array references and C<optgroup> tags from L<Mojo::Collection> objects.
ja: Generate C<select> and C<option> tags from array references and C<optgroup> tags from [[Mojo::Collection]] objects.

source: Generate HMAC-SHA1 checksum for bytes with L<Digest::SHA>.
ja: Generate HMAC-SHA1 checksum for bytes with [[Digest::SHA]].

source: Generate HMAC-SHA1 checksum for bytestream with L<Mojo::Util/"hmac_sha1_sum">.
ja: Generate HMAC-SHA1 checksum for bytestream with [[Mojo::Util/"hmac_sha1_sum"]].

source: Generate JSON content with L<Mojo::JSON>.
ja: Generate JSON content with [[Mojo::JSON]].

source: Generate L<Mojo::Transaction::HTTP> object with L<Mojo::UserAgent::Transactor/"tx">.
ja: Generate [[Mojo::Transaction::HTTP]] object with [[Mojo::UserAgent::Transactor/"tx"]].

source: Generate L<Mojo::Transaction::HTTP> object with L<Mojo::UserAgent::Transactor/"websocket">.
ja: Generate [[Mojo::Transaction::HTTP]] object with [[Mojo::UserAgent::Transactor/"websocket"]].

source: Generate L<Mojolicious::Routes::Route> object for a nested route with its own intermediate destination, takes the same arguments as L</"any"> (except for the HTTP methods to match, which are not available).
ja: Generate [[Mojolicious::Routes::Route]] object for a nested route with its own intermediate destination, takes the same arguments as [[/"any"]] (except for the HTTP methods to match, which are not available).

source: Generate L<Mojolicious::Routes::Route> object matching any of the listed HTTP request methods or all.
ja: Generate [[Mojolicious::Routes::Route]] object matching any of the listed HTTP request methods or all.

source: Generate L<Mojolicious::Routes::Route> object matching only C<DELETE> requests, takes the same arguments as L</"any"> (except for the HTTP methods to match, which are implied).
ja: Generate [[Mojolicious::Routes::Route]] object matching only C<DELETE> requests, takes the same arguments as [[/"any"]] (except for the HTTP methods to match, which are implied).

source: Generate L<Mojolicious::Routes::Route> object matching only C<GET> requests, takes the same arguments as L</"any"> (except for the HTTP methods to match, which are implied).
ja: Generate [[Mojolicious::Routes::Route]] object matching only C<GET> requests, takes the same arguments as [[/"any"]] (except for the HTTP methods to match, which are implied).

source: Generate L<Mojolicious::Routes::Route> object matching only C<OPTIONS> requests, takes the same arguments as L</"any"> (except for the HTTP methods to match, which are implied).
ja: Generate [[Mojolicious::Routes::Route]] object matching only C<OPTIONS> requests, takes the same arguments as [[/"any"]] (except for the HTTP methods to match, which are implied).

source: Generate L<Mojolicious::Routes::Route> object matching only C<PATCH> requests, takes the same arguments as L</"any"> (except for the HTTP methods to match, which are implied).
ja: Generate [[Mojolicious::Routes::Route]] object matching only C<PATCH> requests, takes the same arguments as [[/"any"]] (except for the HTTP methods to match, which are implied).

source: Generate L<Mojolicious::Routes::Route> object matching only C<POST> requests, takes the same arguments as L</"any"> (except for the HTTP methods to match, which are implied).
ja: Generate [[Mojolicious::Routes::Route]] object matching only C<POST> requests, takes the same arguments as [[/"any"]] (except for the HTTP methods to match, which are implied).

source: Generate L<Mojolicious::Routes::Route> object matching only C<PUT> requests, takes the same arguments as L</"any"> (except for the HTTP methods to match, which are implied).
ja: Generate [[Mojolicious::Routes::Route]] object matching only C<PUT> requests, takes the same arguments as [[/"any"]] (except for the HTTP methods to match, which are implied).

source: Generate L<Mojolicious::Routes::Route> object matching only WebSocket handshakes, takes the same arguments as L</"any"> (except for the HTTP methods to match, which are implied).
ja: Generate [[Mojolicious::Routes::Route]] object matching only WebSocket handshakes, takes the same arguments as [[/"any"]] (except for the HTTP methods to match, which are implied).

source: Generate MD5 checksum for bytes with L<Digest::MD5>.
ja: Generate MD5 checksum for bytes with [[Digest::MD5]].

source: Generate MD5 checksum for bytestream with L<Mojo::Util/"md5_sum">.
ja: Generate MD5 checksum for bytestream with [[Mojo::Util/"md5_sum"]].

source: Generate SHA1 checksum for bytes with L<Digest::SHA>.
ja: Generate SHA1 checksum for bytes with [[Digest::SHA]].

source: Generate SHA1 checksum for bytestream with L<Mojo::Util/"sha1_sum">.
ja: Generate SHA1 checksum for bytestream with [[Mojo::Util/"sha1_sum"]].

source: Generate URL slug for bytestream with L<Mojo::Util/"slugify">.
ja: Generate URL slug for bytestream with [[Mojo::Util/"slugify"]].

source: Generate a portable L<Mojo::URL> object with base for a path, URL or route.
ja: Generate a portable [[Mojo::URL]] object with base for a path, URL or route.

source: Generate binary MD5 checksum for bytes with L<Digest::MD5>.
ja: Generate binary MD5 checksum for bytes with [[Digest::MD5]].

source: Generate binary MD5 checksum for bytestream with L<Mojo::Util/"md5_bytes">.
ja: Generate binary MD5 checksum for bytestream with [[Mojo::Util/"md5_bytes"]].

source: Generate binary SHA1 checksum for bytes with L<Digest::SHA>.
ja: Generate binary SHA1 checksum for bytes with [[Digest::SHA]].

source: Generate binary SHA1 checksum for bytestream with L<Mojo::Util/"sha1_bytes">.
ja: Generate binary SHA1 checksum for bytestream with [[Mojo::Util/"sha1_bytes"]].

source: Generate default response message for status code, defaults to using L</"code">.
ja: Generate default response message for status code, defaults to using [[/"code"]].

source: Generate nested route with L<Mojolicious::Routes::Route/"under">, to which all following routes are automatically appended.
ja: Generate nested route with [[Mojolicious::Routes::Route/"under"]], to which all following routes are automatically appended.

source: Generate portable C<a> tag with L<Mojolicious::Controller/"url_for">, defaults to using the capitalized link target as content.
ja: Generate portable C<a> tag with [[Mojolicious::Controller/"url_for">, defaults to using the capitalized link target as content.

source: Generate portable C<form> tag with L</"form_for">, containing a single button.
ja: Generate portable C<form> tag with [[/"form_for"]], containing a single button.

source: Generate portable C<form> tag with L<Mojolicious::Controller/"url_for">.
ja: Generate portable C<form> tag with [[Mojolicious::Controller/"url_for">.

source: Generate route with L<Mojolicious::Routes::Route/"any">, matching any of the listed HTTP request methods or all.
ja: Generate route with [[Mojolicious::Routes::Route/"any"]], matching any of the listed HTTP request methods or all.

source: Generate route with L<Mojolicious::Routes::Route/"delete">, matching only C<DELETE> requests.
ja: Generate route with [[Mojolicious::Routes::Route/"delete"]], matching only C<DELETE> requests.

source: Generate route with L<Mojolicious::Routes::Route/"get">, matching only C<GET> requests.
ja: Generate route with [[Mojolicious::Routes::Route/"get"]], matching only C<GET> requests.

source: Generate route with L<Mojolicious::Routes::Route/"options">, matching only C<OPTIONS> requests.
ja: Generate route with [[Mojolicious::Routes::Route/"options"]], matching only C<OPTIONS> requests.

source: Generate route with L<Mojolicious::Routes::Route/"patch">, matching only C<PATCH> requests.
ja: Generate route with [[Mojolicious::Routes::Route/"patch"]], matching only C<PATCH> requests.

source: Generate route with L<Mojolicious::Routes::Route/"post">, matching only C<POST> requests.
ja: Generate route with [[Mojolicious::Routes::Route/"post"]], matching only C<POST> requests.
